# St7EnableMode

Enables the specified mode in the modal superposition file for harmonic response, spectral response and linear
transient dynamic analysis with mode superposition.

long St7EnableMode(long uID, long ModeNum)
Input Parameters
uID
Strand7 model file ID.
ModeNum
Mode number to enable.